## Terraform Plan
```hcl
22:48:27.809 WARN   The `--terragrunt-non-interactive` flag is deprecated and will be removed in a future version of Terragrunt. Use `--non-interactive` instead.
22:48:27.811 INFO   The stack at . will be processed in the following order for command plan:
Group 1
- Module .


22:48:27.840 INFO   Downloading Terraform configurations from ../.. into ./.terragrunt-cache/IYTR1OWo9cx9AWqXRHdtn6CTLTk/H9usOXzMQKcIVRafqLdmctM3Ucw
22:48:28.251 INFO   tofu: Initializing the backend...
22:48:28.525 INFO   tofu: Successfully configured the backend "s3"! OpenTofu will automatically
22:48:28.525 INFO   tofu: use this backend unless the backend configuration changes.
22:48:28.688 INFO   tofu: Initializing modules...
22:48:28.691 INFO   tofu: - dynamodb in ../dynamodb
22:48:28.692 INFO   tofu: - ec2 in ../ec2
22:48:28.693 INFO   tofu: - ecr in ../ecr
22:48:28.694 INFO   tofu: - eks in ../eks
22:48:28.753 INFO   tofu: Downloading registry.opentofu.org/terraform-aws-modules/eks/aws 19.21.0 for eks.eks...
22:48:29.337 INFO   tofu: - eks.eks in .terraform/modules/eks.eks
22:48:29.343 INFO   tofu: - eks.eks.eks_managed_node_group in .terraform/modules/eks.eks/modules/eks-managed-node-group
22:48:29.344 INFO   tofu: - eks.eks.eks_managed_node_group.user_data in .terraform/modules/eks.eks/modules/_user_data
22:48:29.346 INFO   tofu: - eks.eks.fargate_profile in .terraform/modules/eks.eks/modules/fargate-profile
22:48:29.359 INFO   tofu: Downloading registry.opentofu.org/terraform-aws-modules/kms/aws 2.1.0 for eks.eks.kms...
22:48:29.659 INFO   tofu: - eks.eks.kms in .terraform/modules/eks.eks.kms
22:48:29.672 INFO   tofu: - eks.eks.self_managed_node_group in .terraform/modules/eks.eks/modules/self-managed-node-group
22:48:29.673 INFO   tofu: - eks.eks.self_managed_node_group.user_data in .terraform/modules/eks.eks/modules/_user_data
22:48:29.674 INFO   tofu: - rds in ../rds
22:48:29.690 INFO   tofu: Downloading registry.opentofu.org/terraform-aws-modules/rds/aws 6.10.0 for rds.db...
22:48:30.628 INFO   tofu: - rds.db in .terraform/modules/rds.db
22:48:30.635 INFO   tofu: - rds.db.db_instance in .terraform/modules/rds.db/modules/db_instance
22:48:30.635 INFO   tofu: - rds.db.db_instance_role_association in .terraform/modules/rds.db/modules/db_instance_role_association
22:48:30.636 INFO   tofu: - rds.db.db_option_group in .terraform/modules/rds.db/modules/db_option_group
22:48:30.637 INFO   tofu: - rds.db.db_parameter_group in .terraform/modules/rds.db/modules/db_parameter_group
22:48:30.637 INFO   tofu: - rds.db.db_subnet_group in .terraform/modules/rds.db/modules/db_subnet_group
22:48:30.638 INFO   tofu: - redis in ../redis
22:48:30.639 INFO   tofu: - s3 in ../s3
22:48:30.639 INFO   tofu: - sqs in ../sqs
22:48:30.640 INFO   tofu: - vpc in ../vpc
22:48:30.650 INFO   tofu: Initializing provider plugins...
22:48:30.650 INFO   tofu: - Finding hashicorp/tls versions matching ">= 3.0.0"...
22:48:30.681 INFO   tofu: - Finding hashicorp/kubernetes versions matching ">= 2.10.0"...
22:48:30.693 INFO   tofu: - Finding hashicorp/time versions matching ">= 0.9.0"...
22:48:30.712 INFO   tofu: - Finding hashicorp/cloudinit versions matching ">= 2.0.0"...
22:48:30.725 INFO   tofu: - Finding hashicorp/random versions matching ">= 3.1.0"...
22:48:30.737 INFO   tofu: - Finding hashicorp/aws versions matching ">= 4.33.0, >= 4.57.0, >= 5.0.0, >= 5.59.0, >= 5.62.0, < 6.0.0"...
22:48:31.074 INFO   tofu: - Installing hashicorp/cloudinit v2.3.7...
22:48:31.275 INFO   tofu: - Installed hashicorp/cloudinit v2.3.7 (signed, key ID 0C0AF313E5FD9F80)
22:48:31.458 INFO   tofu: - Installing hashicorp/random v3.8.1...
22:48:31.686 INFO   tofu: - Installed hashicorp/random v3.8.1 (signed, key ID 0C0AF313E5FD9F80)
22:48:31.747 INFO   tofu: - Installing hashicorp/aws v5.100.0...
22:48:35.916 INFO   tofu: - Installed hashicorp/aws v5.100.0 (signed, key ID 0C0AF313E5FD9F80)
22:48:36.106 INFO   tofu: - Installing hashicorp/tls v4.2.1...
22:48:36.383 INFO   tofu: - Installed hashicorp/tls v4.2.1 (signed, key ID 0C0AF313E5FD9F80)
22:48:36.565 INFO   tofu: - Installing hashicorp/kubernetes v3.0.1...
22:48:37.181 INFO   tofu: - Installed hashicorp/kubernetes v3.0.1 (signed, key ID 0C0AF313E5FD9F80)
22:48:37.366 INFO   tofu: - Installing hashicorp/time v0.13.1...
22:48:37.568 INFO   tofu: - Installed hashicorp/time v0.13.1 (signed, key ID 0C0AF313E5FD9F80)
22:48:37.568 INFO   tofu: Providers are signed by their developers.
22:48:37.568 INFO   tofu: If you'd like to know more about provider signing, you can read about it here:
22:48:37.568 INFO   tofu: https://opentofu.org/docs/cli/plugins/signing/
22:48:37.568 INFO   tofu: OpenTofu has created a lock file .terraform.lock.hcl to record the provider
22:48:37.568 INFO   tofu: selections it made above. Include this file in your version control repository
22:48:37.568 INFO   tofu: so that OpenTofu can guarantee to make the same selections by default when
22:48:37.568 INFO   tofu: you run "tofu init" in the future.
22:48:37.568 INFO   tofu: OpenTofu has been successfully initialized!
22:48:37.568 INFO   tofu: You may now begin working with OpenTofu. Try running "tofu plan" to see
22:48:37.568 INFO   tofu: any changes that are required for your infrastructure. All OpenTofu commands
22:48:37.568 INFO   tofu: should now work.
22:48:37.568 INFO   tofu: If you ever set or change modules or backend configuration for OpenTofu,
22:48:37.568 INFO   tofu: rerun this command to reinitialize your working directory. If you forget, other
22:48:37.568 INFO   tofu: commands will detect it and remind you to do so if necessary.
22:48:37.571 INFO   Executing hook: patch_eks
Patching ./.terraform/modules/eks.eks/main.tf...
Patch applied to ./.terraform/modules/eks.eks/main.tf
22:48:41.744 STDOUT tofu: module.eks[0].data.aws_caller_identity.current: Reading...
22:48:41.744 STDOUT tofu: module.rds["flag-db"].module.db.module.db_instance.data.aws_iam_policy_document.enhanced_monitoring: Reading...
22:48:41.745 STDOUT tofu: module.eks[0].module.eks.data.aws_caller_identity.current: Reading...
22:48:41.752 STDOUT tofu: module.eks[0].module.eks.data.aws_partition.current: Reading...
22:48:41.752 STDOUT tofu: module.rds["analytics-db"].module.db.module.db_instance.data.aws_iam_policy_document.enhanced_monitoring: Reading...
22:48:41.755 STDOUT tofu: module.rds["flag-db"].module.db.module.db_instance.data.aws_iam_policy_document.enhanced_monitoring: Read complete after 0s [id=76086537]
22:48:41.757 STDOUT tofu: module.eks[0].module.eks.data.aws_partition.current: Read complete after 0s [id=aws]
22:48:41.757 STDOUT tofu: module.rds["analytics-db"].module.db.module.db_instance.data.aws_iam_policy_document.enhanced_monitoring: Read complete after 0s [id=76086537]
22:48:41.757 STDOUT tofu: module.rds["auth-db"].module.db.module.db_instance.data.aws_iam_policy_document.enhanced_monitoring: Reading...
22:48:41.758 STDOUT tofu: module.rds["auth-db"].module.db.module.db_instance.data.aws_partition.current: Reading...
22:48:41.762 STDOUT tofu: module.rds["flag-db"].module.db.module.db_instance.data.aws_partition.current: Reading...
22:48:41.762 STDOUT tofu: module.rds["auth-db"].module.db.module.db_instance.data.aws_partition.current: Read complete after 0s [id=aws]
22:48:41.767 STDOUT tofu: module.rds["auth-db"].module.db.module.db_instance.data.aws_iam_policy_document.enhanced_monitoring: Read complete after 0s [id=76086537]
22:48:41.771 STDOUT tofu: module.rds["analytics-db"].module.db.module.db_instance.data.aws_partition.current: Reading...
22:48:41.771 STDOUT tofu: module.rds["flag-db"].module.db.module.db_instance.data.aws_partition.current: Read complete after 0s [id=aws]
22:48:41.778 STDOUT tofu: module.rds["analytics-db"].module.db.module.db_instance.data.aws_partition.current: Read complete after 0s [id=aws]
22:48:41.781 STDOUT tofu: module.eks[0].data.aws_caller_identity.current: Read complete after 0s [id=447941455905]
22:48:41.798 STDOUT tofu: module.eks[0].module.eks.data.aws_caller_identity.current: Read complete after 0s [id=447941455905]
22:48:41.833 STDOUT tofu: module.eks[0].module.eks.module.eks_managed_node_group["toggle-master-ng"].data.aws_caller_identity.current: Reading...
22:48:41.834 STDOUT tofu: module.eks[0].module.eks.module.eks_managed_node_group["toggle-master-ng"].data.aws_partition.current: Reading...
22:48:41.836 STDOUT tofu: module.eks[0].module.eks.module.eks_managed_node_group["toggle-master-ng"].data.aws_partition.current: Read complete after 0s [id=aws]
22:48:41.867 STDOUT tofu: module.eks[0].module.eks.module.eks_managed_node_group["toggle-master-ng"].data.aws_caller_identity.current: Read complete after 0s [id=447941455905]
22:48:42.278 STDOUT tofu: OpenTofu used the selected providers to generate the following execution
22:48:42.279 STDOUT tofu: plan. Resource actions are indicated with the following symbols:
22:48:42.279 STDOUT tofu:   + create
22:48:42.279 STDOUT tofu:  <= read (data resources)
22:48:42.279 STDOUT tofu: OpenTofu will perform the following actions:
22:48:42.280 STDOUT tofu:   # data.aws_eks_cluster.this[0] will be read during apply
22:48:42.280 STDOUT tofu:   # (depends on a resource or a module with changes pending)
22:48:42.280 STDOUT tofu:  <= data "aws_eks_cluster" "this" {
22:48:42.281 STDOUT tofu:       + access_config             = (known after apply)
22:48:42.282 STDOUT tofu:       + arn                       = (known after apply)
22:48:42.282 STDOUT tofu:       + certificate_authority     = (known after apply)
22:48:42.283 STDOUT tofu:       + cluster_id                = (known after apply)
22:48:42.283 STDOUT tofu:       + compute_config            = (known after apply)
22:48:42.283 STDOUT tofu:       + created_at                = (known after apply)
22:48:42.283 STDOUT tofu:       + enabled_cluster_log_types = (known after apply)
22:48:42.283 STDOUT tofu:       + endpoint                  = (known after apply)
22:48:42.283 STDOUT tofu:       + id                        = (known after apply)
22:48:42.283 STDOUT tofu:       + identity                  = (known after apply)
22:48:42.284 STDOUT tofu:       + kubernetes_network_config = (known after apply)
22:48:42.284 STDOUT tofu:       + name                      = "toggle-master-eks"
22:48:42.284 STDOUT tofu:       + outpost_config            = (known after apply)
22:48:42.284 STDOUT tofu:       + platform_version          = (known after apply)
22:48:42.284 STDOUT tofu:       + remote_network_config     = (known after apply)
22:48:42.284 STDOUT tofu:       + role_arn                  = (known after apply)
22:48:42.284 STDOUT tofu:       + status                    = (known after apply)
22:48:42.284 STDOUT tofu:       + storage_config            = (known after apply)
22:48:42.284 STDOUT tofu:       + tags                      = (known after apply)
22:48:42.284 STDOUT tofu:       + upgrade_policy            = (known after apply)
22:48:42.284 STDOUT tofu:       + version                   = (known after apply)
22:48:42.286 STDOUT tofu:       + vpc_config                = (known after apply)
22:48:42.287 STDOUT tofu:       + zonal_shift_config        = (known after apply)
22:48:42.287 STDOUT tofu:     }
22:48:42.287 STDOUT tofu:   # data.aws_eks_cluster_auth.this[0] will be read during apply
22:48:42.288 STDOUT tofu:   # (depends on a resource or a module with changes pending)
22:48:42.288 STDOUT tofu:  <= data "aws_eks_cluster_auth" "this" {
22:48:42.288 STDOUT tofu:       + id    = (known after apply)
22:48:42.288 STDOUT tofu:       + name  = "toggle-master-eks"
22:48:42.288 STDOUT tofu:       + token = (sensitive value)
22:48:42.288 STDOUT tofu:     }
22:48:42.288 STDOUT tofu:   # module.dynamodb["analytics-events"].aws_dynamodb_table.this will be created
22:48:42.288 STDOUT tofu:   + resource "aws_dynamodb_table" "this" {
22:48:42.288 STDOUT tofu:       + arn              = (known after apply)
22:48:42.288 STDOUT tofu:       + billing_mode     = "PAY_PER_REQUEST"
22:48:42.288 STDOUT tofu:       + hash_key         = "event_id"
22:48:42.288 STDOUT tofu:       + id               = (known after apply)
22:48:42.288 STDOUT tofu:       + name             = "analytics_events"
22:48:42.289 STDOUT tofu:       + read_capacity    = (known after apply)
22:48:42.289 STDOUT tofu:       + stream_arn       = (known after apply)
22:48:42.289 STDOUT tofu:       + stream_label     = (known after apply)
22:48:42.290 STDOUT tofu:       + stream_view_type = (known after apply)
22:48:42.290 STDOUT tofu:       + tags             = {
22:48:42.290 STDOUT tofu:           + "Env"     = "dev"
22:48:42.291 STDOUT tofu:           + "Name"    = "analytics_events"
22:48:42.291 STDOUT tofu:           + "Project" = "toggle-master"
22:48:42.291 STDOUT tofu:         }
22:48:42.291 STDOUT tofu:       + tags_all         = {
22:48:42.291 STDOUT tofu:           + "Env"     = "dev"
22:48:42.292 STDOUT tofu:           + "Name"    = "analytics_events"
22:48:42.292 STDOUT tofu:           + "Project" = "toggle-master"
22:48:42.292 STDOUT tofu:         }
22:48:42.292 STDOUT tofu:       + write_capacity   = (known after apply)
22:48:42.293 STDOUT tofu:       + attribute {
22:48:42.293 STDOUT tofu:           + name = "event_id"
22:48:42.293 STDOUT tofu:           + type = "S"
22:48:42.293 STDOUT tofu:         }
22:48:42.294 STDOUT tofu:       + point_in_time_recovery (known after apply)
22:48:42.294 STDOUT tofu:       + server_side_encryption (known after apply)
22:48:42.294 STDOUT tofu:       + ttl (known after apply)
22:48:42.294 STDOUT tofu:     }
22:48:42.295 STDOUT tofu:   # module.ec2.aws_instance.bastion will be created
22:48:42.295 STDOUT tofu:   + resource "aws_instance" "bastion" {
22:48:42.295 STDOUT tofu:       + ami                                  = "ami-0b6c6ebed2801a5cb"
22:48:42.295 STDOUT tofu:       + arn                                  = (known after apply)
22:48:42.296 STDOUT tofu:       + associate_public_ip_address          = (known after apply)
22:48:42.296 STDOUT tofu:       + availability_zone                    = (known after apply)
22:48:42.296 STDOUT tofu:       + cpu_core_count                       = (known after apply)
22:48:42.297 STDOUT tofu:       + cpu_threads_per_core                 = (known after apply)
22:48:42.297 STDOUT tofu:       + disable_api_stop                     = (known after apply)
22:48:42.297 STDOUT tofu:       + disable_api_termination              = (known after apply)
22:48:42.297 STDOUT tofu:       + ebs_optimized                        = (known after apply)
22:48:42.297 STDOUT tofu:       + enable_primary_ipv6                  = (known after apply)
22:48:42.298 STDOUT tofu:       + get_password_data                    = false
22:48:42.298 STDOUT tofu:       + host_id                              = (known after apply)
22:48:42.298 STDOUT tofu:       + host_resource_group_arn              = (known after apply)
22:48:42.299 STDOUT tofu:       + iam_instance_profile                 = (known after apply)
22:48:42.299 STDOUT tofu:       + id                                   = (known after apply)
22:48:42.299 STDOUT tofu:       + instance_initiated_shutdown_behavior = (known after apply)
22:48:42.300 STDOUT tofu:       + instance_lifecycle                   = (known after apply)
22:48:42.300 STDOUT tofu:       + instance_state                       = (known after apply)
22:48:42.300 STDOUT tofu:       + instance_type                        = "t3.small"
22:48:42.300 STDOUT tofu:       + ipv6_address_count                   = (known after apply)
22:48:42.300 STDOUT tofu:       + ipv6_addresses                       = (known after apply)
22:48:42.300 STDOUT tofu:       + key_name                             = "iac-key"
22:48:42.300 STDOUT tofu:       + monitoring                           = (known after apply)
22:48:42.301 STDOUT tofu:       + outpost_arn                          = (known after apply)
22:48:42.301 STDOUT tofu:       + password_data                        = (known after apply)
22:48:42.301 STDOUT tofu:       + placement_group                      = (known after apply)
22:48:42.301 STDOUT tofu:       + placement_partition_number           = (known after apply)
22:48:42.301 STDOUT tofu:       + primary_network_interface_id         = (known after apply)
22:48:42.301 STDOUT tofu:       + private_dns                          = (known after apply)
22:48:42.301 STDOUT tofu:       + private_ip                           = (known after apply)
22:48:42.301 STDOUT tofu:       + public_dns                           = (known after apply)
22:48:42.302 STDOUT tofu:       + public_ip                            = (known after apply)
22:48:42.302 STDOUT tofu:       + secondary_private_ips                = (known after apply)
22:48:42.302 STDOUT tofu:       + security_groups                      = (known after apply)
22:48:42.302 STDOUT tofu:       + source_dest_check                    = true
22:48:42.302 STDOUT tofu:       + spot_instance_request_id             = (known after apply)
22:48:42.302 STDOUT tofu:       + subnet_id                            = (known after apply)
22:48:42.302 STDOUT tofu:       + tags                                 = {
22:48:42.302 STDOUT tofu:           + "Name"    = "toggle-master-dev-bastion"
22:48:42.302 STDOUT tofu:           + "Project" = "toggle-master"
22:48:42.302 STDOUT tofu:         }
22:48:42.302 STDOUT tofu:       + tags_all                             = {
22:48:42.303 STDOUT tofu:           + "Name"    = "toggle-master-dev-bastion"
22:48:42.303 STDOUT tofu:           + "Project" = "toggle-master"
22:48:42.303 STDOUT tofu:         }
22:48:42.303 STDOUT tofu:       + tenancy                              = (known after apply)
22:48:42.303 STDOUT tofu:       + user_data                            = (known after apply)
22:48:42.303 STDOUT tofu:       + user_data_base64                     = (known after apply)
22:48:42.303 STDOUT tofu:       + user_data_replace_on_change          = false
22:48:42.303 STDOUT tofu:       + vpc_security_group_ids               = (known after apply)
22:48:42.303 STDOUT tofu:       + capacity_reservation_specification (known after apply)
22:48:42.303 STDOUT tofu:       + cpu_options (known after apply)
22:48:42.303 STDOUT tofu:       + ebs_block_device (known after apply)
22:48:42.303 STDOUT tofu:       + enclave_options (known after apply)
22:48:42.303 STDOUT tofu:       + ephemeral_block_device (known after apply)
22:48:42.303 STDOUT tofu:       + instance_market_options (known after apply)
22:48:42.303 STDOUT tofu:       + maintenance_options (known after apply)
22:48:42.303 STDOUT tofu:       + metadata_options (known after apply)
22:48:42.303 STDOUT tofu:       + network_interface (known after apply)
22:48:42.303 STDOUT tofu:       + private_dns_name_options (known after apply)
22:48:42.303 STDOUT tofu:       + root_block_device (known after apply)
22:48:42.303 STDOUT tofu:     }
22:48:42.303 STDOUT tofu:   # module.ec2.aws_security_group.app_sg will be created
22:48:42.303 STDOUT tofu:   + resource "aws_security_group" "app_sg" {
22:48:42.304 STDOUT tofu:       + arn                    = (known after apply)
22:48:42.304 STDOUT tofu:       + description            = "App security group"
22:48:42.304 STDOUT tofu:       + egress                 = [
22:48:42.304 STDOUT tofu:           + {
22:48:42.304 STDOUT tofu:               + cidr_blocks      = [
22:48:42.304 STDOUT tofu:                   + "0.0.0.0/0",
22:48:42.304 STDOUT tofu:                 ]
22:48:42.304 STDOUT tofu:               + description      = ""
22:48:42.304 STDOUT tofu:               + from_port        = 0
22:48:42.304 STDOUT tofu:               + ipv6_cidr_blocks = []
22:48:42.304 STDOUT tofu:               + prefix_list_ids  = []
22:48:42.304 STDOUT tofu:               + protocol         = "-1"
22:48:42.304 STDOUT tofu:               + security_groups  = []
22:48:42.304 STDOUT tofu:               + self             = false
22:48:42.304 STDOUT tofu:               + to_port          = 0
22:48:42.304 STDOUT tofu:             },
22:48:42.304 STDOUT tofu:         ]
22:48:42.304 STDOUT tofu:       + id                     = (known after apply)
22:48:42.304 STDOUT tofu:       + ingress                = [
22:48:42.304 STDOUT tofu:           + {
22:48:42.304 STDOUT tofu:               + cidr_blocks      = [
22:48:42.304 STDOUT tofu:                   + "0.0.0.0/0",
22:48:42.304 STDOUT tofu:                 ]
22:48:42.304 STDOUT tofu:               + description      = "SSH"
22:48:42.304 STDOUT tofu:               + from_port        = 22
22:48:42.304 STDOUT tofu:               + ipv6_cidr_blocks = []
22:48:42.304 STDOUT tofu:               + prefix_list_ids  = []
22:48:42.304 STDOUT tofu:               + protocol         = "tcp"
22:48:42.304 STDOUT tofu:               + security_groups  = []
22:48:42.304 STDOUT tofu:               + self             = false
22:48:42.304 STDOUT tofu:               + to_port          = 22
22:48:42.304 STDOUT tofu:             },
22:48:42.304 STDOUT tofu:         ]
22:48:42.304 STDOUT tofu:       + name                   = "toggle-master-dev-app-sg"
22:48:42.305 STDOUT tofu:       + name_prefix            = (known after apply)
22:48:42.305 STDOUT tofu:       + owner_id               = (known after apply)
22:48:42.305 STDOUT tofu:       + revoke_rules_on_delete = false
22:48:42.305 STDOUT tofu:       + tags                   = {
22:48:42.305 STDOUT tofu:           + "Name"    = "toggle-master-dev-app-sg"
22:48:42.305 STDOUT tofu:           + "Project" = "toggle-master"
22:48:42.305 STDOUT tofu:         }
22:48:42.305 STDOUT tofu:       + tags_all               = {
22:48:42.305 STDOUT tofu:           + "Name"    = "toggle-master-dev-app-sg"
22:48:42.305 STDOUT tofu:           + "Project" = "toggle-master"
22:48:42.305 STDOUT tofu:         }
22:48:42.305 STDOUT tofu:       + vpc_id                 = (known after apply)
22:48:42.305 STDOUT tofu:     }
22:48:42.305 STDOUT tofu:   # module.ecr.aws_ecr_lifecycle_policy.this["toggle-master"] will be created
22:48:42.305 STDOUT tofu:   + resource "aws_ecr_lifecycle_policy" "this" {
22:48:42.305 STDOUT tofu:       + id          = (known after apply)
22:48:42.305 STDOUT tofu:       + policy      = jsonencode(
22:48:42.305 STDOUT tofu:             {
22:48:42.305 STDOUT tofu:               + rules = [
22:48:42.305 STDOUT tofu:                   + {
22:48:42.306 STDOUT tofu:                       + action       = {
22:48:42.306 STDOUT tofu:                           + type = "expire"
22:48:42.306 STDOUT tofu:                         }
22:48:42.306 STDOUT tofu:                       + description  = "Keep last 10 images per service tag"
22:48:42.306 STDOUT tofu:                       + rulePriority = 1
22:48:42.306 STDOUT tofu:                       + selection    = {
22:48:42.306 STDOUT tofu:                           + countNumber   = 10
22:48:42.306 STDOUT tofu:                           + countType     = "imageCountMoreThan"
22:48:42.306 STDOUT tofu:                           + tagPrefixList = [
22:48:42.306 STDOUT tofu:                               + "toggle-master",
22:48:42.306 STDOUT tofu:                             ]
22:48:42.306 STDOUT tofu:                           + tagStatus     = "tagged"
22:48:42.306 STDOUT tofu:                         }
22:48:42.306 STDOUT tofu:                     },
22:48:42.306 STDOUT tofu:                   + {
22:48:42.306 STDOUT tofu:                       + action       = {
22:48:42.306 STDOUT tofu:                           + type = "expire"
22:48:42.306 STDOUT tofu:                         }
22:48:42.306 STDOUT tofu:                       + description  = "Remove untagged images after 1 day"
22:48:42.306 STDOUT tofu:                       + rulePriority = 2
22:48:42.306 STDOUT tofu:                       + selection    = {
22:48:42.306 STDOUT tofu:                           + countNumber = 1
22:48:42.306 STDOUT tofu:                           + countType   = "sinceImagePushed"
22:48:42.306 STDOUT tofu:                           + countUnit   = "days"
22:48:42.306 STDOUT tofu:                           + tagStatus   = "untagged"
22:48:42.307 STDOUT tofu:                         }
22:48:42.307 STDOUT tofu:                     },
22:48:42.307 STDOUT tofu:                 ]
22:48:42.307 STDOUT tofu:             }
22:48:42.307 STDOUT tofu:         )
22:48:42.307 STDOUT tofu:       + registry_id = (known after apply)
22:48:42.307 STDOUT tofu:       + repository  = "toggle-master"
22:48:42.307 STDOUT tofu:     }
22:48:42.307 STDOUT tofu:   # module.ecr.aws_ecr_repository.this["toggle-master"] will be created
22:48:42.307 STDOUT tofu:   + resource "aws_ecr_repository" "this" {
22:48:42.307 STDOUT tofu:       + arn                  = (known after apply)
22:48:42.307 STDOUT tofu:       + force_delete         = true
22:48:42.307 STDOUT tofu:       + id                   = (known after apply)
22:48:42.307 STDOUT tofu:       + image_tag_mutability = "MUTABLE"
22:48:42.307 STDOUT tofu:       + name                 = "toggle-master"
22:48:42.307 STDOUT tofu:       + registry_id          = (known after apply)
22:48:42.307 STDOUT tofu:       + repository_url       = (known after apply)
22:48:42.307 STDOUT tofu:       + tags                 = {
22:48:42.307 STDOUT tofu:           + "Env"     = "dev"
22:48:42.307 STDOUT tofu:           + "Project" = "toggle-master"
22:48:42.307 STDOUT tofu:         }
22:48:42.307 STDOUT tofu:       + tags_all             = {
22:48:42.307 STDOUT tofu:           + "Env"     = "dev"
22:48:42.307 STDOUT tofu:           + "Project" = "toggle-master"
22:48:42.307 STDOUT tofu:         }
22:48:42.307 STDOUT tofu:       + image_scanning_configuration {
22:48:42.307 STDOUT tofu:           + scan_on_push = true
22:48:42.307 STDOUT tofu:         }
22:48:42.307 STDOUT tofu:     }
22:48:42.307 STDOUT tofu:   # module.eks[0].aws_security_group_rule.bastion_to_eks will be created
22:48:42.307 STDOUT tofu:   + resource "aws_security_group_rule" "bastion_to_eks" {
22:48:42.307 STDOUT tofu:       + description              = "Allow bastion to reach EKS API"
22:48:42.308 STDOUT tofu:       + from_port                = 443
22:48:42.308 STDOUT tofu:       + id                       = (known after apply)
22:48:42.308 STDOUT tofu:       + protocol                 = "tcp"
22:48:42.308 STDOUT tofu:       + security_group_id        = (known after apply)
22:48:42.308 STDOUT tofu:       + security_group_rule_id   = (known after apply)
22:48:42.308 STDOUT tofu:       + self                     = false
22:48:42.308 STDOUT tofu:       + source_security_group_id = (known after apply)
22:48:42.308 STDOUT tofu:       + to_port                  = 443
22:48:42.308 STDOUT tofu:       + type                     = "ingress"
22:48:42.308 STDOUT tofu:     }
22:48:42.308 STDOUT tofu:   # module.rds["analytics-db"].aws_security_group.allow_bastion will be created
22:48:42.308 STDOUT tofu:   + resource "aws_security_group" "allow_bastion" {
22:48:42.308 STDOUT tofu:       + arn                    = (known after apply)
22:48:42.308 STDOUT tofu:       + description            = "Acesso controlado ao RDS"
22:48:42.308 STDOUT tofu:       + egress                 = [
22:48:42.308 STDOUT tofu:           + {
22:48:42.308 STDOUT tofu:               + cidr_blocks      = [
22:48:42.308 STDOUT tofu:                   + "0.0.0.0/0",
22:48:42.308 STDOUT tofu:                 ]
22:48:42.308 STDOUT tofu:               + description      = ""
22:48:42.308 STDOUT tofu:               + from_port        = 0
22:48:42.309 STDOUT tofu:               + ipv6_cidr_blocks = []
22:48:42.309 STDOUT tofu:               + prefix_list_ids  = []
22:48:42.309 STDOUT tofu:               + protocol         = "-1"
22:48:42.309 STDOUT tofu:               + security_groups  = []
22:48:42.309 STDOUT tofu:               + self             = false
22:48:42.309 STDOUT tofu:               + to_port          = 0
22:48:42.309 STDOUT tofu:             },
22:48:42.309 STDOUT tofu:         ]
22:48:42.309 STDOUT tofu:       + id                     = (known after apply)
22:48:42.309 STDOUT tofu:       + ingress                = [
22:48:42.309 STDOUT tofu:           + {
22:48:42.309 STDOUT tofu:               + cidr_blocks      = [
22:48:42.309 STDOUT tofu:                   + "10.0.0.0/16",
22:48:42.309 STDOUT tofu:                 ]
22:48:42.309 STDOUT tofu:               + description      = "Postgres interno"
22:48:42.309 STDOUT tofu:               + from_port        = 5432
22:48:42.309 STDOUT tofu:               + ipv6_cidr_blocks = []
22:48:42.309 STDOUT tofu:               + prefix_list_ids  = []
22:48:42.309 STDOUT tofu:               + protocol         = "tcp"
22:48:42.309 STDOUT tofu:               + security_groups  = []
22:48:42.309 STDOUT tofu:               + self             = false
22:48:42.309 STDOUT tofu:               + to_port          = 5432
22:48:42.309 STDOUT tofu:             },
22:48:42.309 STDOUT tofu:         ]
22:48:42.309 STDOUT tofu:       + name                   = "toggle-master-dev-analytics-db-rds-sg"
22:48:42.310 STDOUT tofu:       + name_prefix            = (known after apply)
22:48:42.310 STDOUT tofu:       + owner_id               = (known after apply)
22:48:42.310 STDOUT tofu:       + revoke_rules_on_delete = false
22:48:42.310 STDOUT tofu:       + tags                   = {
22:48:42.310 STDOUT tofu:           + "AppOwner" = "analytics-service"
22:48:42.310 STDOUT tofu:           + "Name"     = "toggle-master-dev-rds-sg"
22:48:42.310 STDOUT tofu:           + "Project"  = "toggle-master"
22:48:42.310 STDOUT tofu:         }
22:48:42.310 STDOUT tofu:       + tags_all               = {
22:48:42.310 STDOUT tofu:           + "AppOwner" = "analytics-service"
22:48:42.310 STDOUT tofu:           + "Name"     = "toggle-master-dev-rds-sg"
22:48:42.311 STDOUT tofu:           + "Project"  = "toggle-master"
22:48:42.311 STDOUT tofu:         }
22:48:42.311 STDOUT tofu:       + vpc_id                 = (known after apply)
22:48:42.311 STDOUT tofu:     }
22:48:42.311 STDOUT tofu:   # module.rds["auth-db"].aws_security_group.allow_bastion will be created
22:48:42.311 STDOUT tofu:   + resource "aws_security_group" "allow_bastion" {
22:48:42.311 STDOUT tofu:       + arn                    = (known after apply)
22:48:42.311 STDOUT tofu:       + description            = "Acesso controlado ao RDS"
22:48:42.311 STDOUT tofu:       + egress                 = [
22:48:42.311 STDOUT tofu:           + {
22:48:42.311 STDOUT tofu:               + cidr_blocks      = [
22:48:42.311 STDOUT tofu:                   + "0.0.0.0/0",
22:48:42.311 STDOUT tofu:                 ]
22:48:42.311 STDOUT tofu:               + description      = ""
22:48:42.311 STDOUT tofu:               + from_port        = 0
22:48:42.311 STDOUT tofu:               + ipv6_cidr_blocks = []
22:48:42.311 STDOUT tofu:               + prefix_list_ids  = []
22:48:42.311 STDOUT tofu:               + protocol         = "-1"
22:48:42.311 STDOUT tofu:               + security_groups  = []
22:48:42.311 STDOUT tofu:               + self             = false
22:48:42.311 STDOUT tofu:               + to_port          = 0
22:48:42.311 STDOUT tofu:             },
22:48:42.311 STDOUT tofu:         ]
22:48:42.311 STDOUT tofu:       + id                     = (known after apply)
22:48:42.311 STDOUT tofu:       + ingress                = [
22:48:42.311 STDOUT tofu:           + {
22:48:42.311 STDOUT tofu:               + cidr_blocks      = [
22:48:42.311 STDOUT tofu:                   + "10.0.0.0/16",
22:48:42.311 STDOUT tofu:                 ]
22:48:42.311 STDOUT tofu:               + description      = "Postgres interno"
22:48:42.312 STDOUT tofu:               + from_port        = 5432
22:48:42.312 STDOUT tofu:               + ipv6_cidr_blocks = []
22:48:42.312 STDOUT tofu:               + prefix_list_ids  = []
22:48:42.312 STDOUT tofu:               + protocol         = "tcp"
22:48:42.312 STDOUT tofu:               + security_groups  = []
22:48:42.312 STDOUT tofu:               + self             = false
22:48:42.312 STDOUT tofu:               + to_port          = 5432
22:48:42.312 STDOUT tofu:             },
22:48:42.312 STDOUT tofu:         ]
22:48:42.312 STDOUT tofu:       + name                   = "toggle-master-dev-auth-db-rds-sg"
22:48:42.312 STDOUT tofu:       + name_prefix            = (known after apply)
22:48:42.312 STDOUT tofu:       + owner_id               = (known after apply)
22:48:42.312 STDOUT tofu:       + revoke_rules_on_delete = false
22:48:42.312 STDOUT tofu:       + tags                   = {
22:48:42.312 STDOUT tofu:           + "AppOwner" = "auth-service"
22:48:42.312 STDOUT tofu:           + "Name"     = "toggle-master-dev-rds-sg"
22:48:42.312 STDOUT tofu:           + "Project"  = "toggle-master"
22:48:42.312 STDOUT tofu:         }
22:48:42.312 STDOUT tofu:       + tags_all               = {
22:48:42.312 STDOUT tofu:           + "AppOwner" = "auth-service"
22:48:42.312 STDOUT tofu:           + "Name"     = "toggle-master-dev-rds-sg"
22:48:42.312 STDOUT tofu:           + "Project"  = "toggle-master"
22:48:42.313 STDOUT tofu:         }
22:48:42.313 STDOUT tofu:       + vpc_id                 = (known after apply)
22:48:42.313 STDOUT tofu:     }
22:48:42.313 STDOUT tofu:   # module.rds["flag-db"].aws_security_group.allow_bastion will be created
22:48:42.313 STDOUT tofu:   + resource "aws_security_group" "allow_bastion" {
22:48:42.313 STDOUT tofu:       + arn                    = (known after apply)
22:48:42.313 STDOUT tofu:       + description            = "Acesso controlado ao RDS"
22:48:42.313 STDOUT tofu:       + egress                 = [
22:48:42.313 STDOUT tofu:           + {
22:48:42.313 STDOUT tofu:               + cidr_blocks      = [
22:48:42.313 STDOUT tofu:                   + "0.0.0.0/0",
22:48:42.313 STDOUT tofu:                 ]
22:48:42.313 STDOUT tofu:               + description      = ""
22:48:42.313 STDOUT tofu:               + from_port        = 0
22:48:42.313 STDOUT tofu:               + ipv6_cidr_blocks = []
22:48:42.313 STDOUT tofu:               + prefix_list_ids  = []
22:48:42.313 STDOUT tofu:               + protocol         = "-1"
22:48:42.313 STDOUT tofu:               + security_groups  = []
22:48:42.313 STDOUT tofu:               + self             = false
22:48:42.313 STDOUT tofu:               + to_port          = 0
22:48:42.313 STDOUT tofu:             },
22:48:42.313 STDOUT tofu:         ]
22:48:42.313 STDOUT tofu:       + id                     = (known after apply)
22:48:42.313 STDOUT tofu:       + ingress                = [
22:48:42.313 STDOUT tofu:           + {
22:48:42.313 STDOUT tofu:               + cidr_blocks      = [
22:48:42.313 STDOUT tofu:                   + "10.0.0.0/16",
22:48:42.313 STDOUT tofu:                 ]
22:48:42.313 STDOUT tofu:               + description      = "Postgres interno"
22:48:42.313 STDOUT tofu:               + from_port        = 5432
22:48:42.313 STDOUT tofu:               + ipv6_cidr_blocks = []
22:48:42.313 STDOUT tofu:               + prefix_list_ids  = []
22:48:42.313 STDOUT tofu:               + protocol         = "tcp"
22:48:42.313 STDOUT tofu:               + security_groups  = []
22:48:42.313 STDOUT tofu:               + self             = false
22:48:42.313 STDOUT tofu:               + to_port          = 5432
22:48:42.313 STDOUT tofu:             },
22:48:42.314 STDOUT tofu:         ]
22:48:42.314 STDOUT tofu:       + name                   = "toggle-master-dev-flag-db-rds-sg"
22:48:42.314 STDOUT tofu:       + name_prefix            = (known after apply)
22:48:42.314 STDOUT tofu:       + owner_id               = (known after apply)
22:48:42.314 STDOUT tofu:       + revoke_rules_on_delete = false
22:48:42.314 STDOUT tofu:       + tags                   = {
22:48:42.314 STDOUT tofu:           + "AppOwner" = "flag-service"
22:48:42.314 STDOUT tofu:           + "Name"     = "toggle-master-dev-rds-sg"
22:48:42.314 STDOUT tofu:           + "Project"  = "toggle-master"
22:48:42.314 STDOUT tofu:         }
22:48:42.314 STDOUT tofu:       + tags_all               = {
22:48:42.314 STDOUT tofu:           + "AppOwner" = "flag-service"
22:48:42.314 STDOUT tofu:           + "Name"     = "toggle-master-dev-rds-sg"
22:48:42.314 STDOUT tofu:           + "Project"  = "toggle-master"
22:48:42.314 STDOUT tofu:         }
22:48:42.314 STDOUT tofu:       + vpc_id                 = (known after apply)
22:48:42.314 STDOUT tofu:     }
22:48:42.314 STDOUT tofu:   # module.redis["evaluation"].aws_elasticache_cluster.this will be created
22:48:42.314 STDOUT tofu:   + resource "aws_elasticache_cluster" "this" {
22:48:42.314 STDOUT tofu:       + apply_immediately          = (known after apply)
22:48:42.314 STDOUT tofu:       + arn                        = (known after apply)
22:48:42.314 STDOUT tofu:       + auto_minor_version_upgrade = "true"
22:48:42.314 STDOUT tofu:       + availability_zone          = (known after apply)
22:48:42.314 STDOUT tofu:       + az_mode                    = (known after apply)
22:48:42.314 STDOUT tofu:       + cache_nodes                = (known after apply)
22:48:42.315 STDOUT tofu:       + cluster_address            = (known after apply)
22:48:42.315 STDOUT tofu:       + cluster_id                 = "redis-evaluation"
22:48:42.315 STDOUT tofu:       + configuration_endpoint     = (known after apply)
22:48:42.315 STDOUT tofu:       + engine                     = "redis"
22:48:42.315 STDOUT tofu:       + engine_version             = "7.0"
22:48:42.315 STDOUT tofu:       + engine_version_actual      = (known after apply)
22:48:42.315 STDOUT tofu:       + id                         = (known after apply)
22:48:42.315 STDOUT tofu:       + ip_discovery               = (known after apply)
22:48:42.315 STDOUT tofu:       + maintenance_window         = (known after apply)
22:48:42.315 STDOUT tofu:       + network_type               = (known after apply)
22:48:42.315 STDOUT tofu:       + node_type                  = "cache.t3.micro"
22:48:42.315 STDOUT tofu:       + num_cache_nodes            = 1
22:48:42.315 STDOUT tofu:       + parameter_group_name       = (known after apply)
22:48:42.315 STDOUT tofu:       + port                       = 6379
22:48:42.315 STDOUT tofu:       + preferred_outpost_arn      = (known after apply)
22:48:42.315 STDOUT tofu:       + replication_group_id       = (known after apply)
22:48:42.315 STDOUT tofu:       + security_group_ids         = (known after apply)
22:48:42.315 STDOUT tofu:       + snapshot_window            = (known after apply)
22:48:42.315 STDOUT tofu:       + subnet_group_name          = "redis-evaluation-subnet-group"
22:48:42.315 STDOUT tofu:       + tags                       = {
22:48:42.315 STDOUT tofu:           + "Env"     = "dev"
22:48:42.315 STDOUT tofu:           + "Name"    = "redis-evaluation"
22:48:42.316 STDOUT tofu:           + "Project" = "toggle-master"
22:48:42.316 STDOUT tofu:         }
22:48:42.316 STDOUT tofu:       + tags_all                   = {
22:48:42.316 STDOUT tofu:           + "Env"     = "dev"
22:48:42.316 STDOUT tofu:           + "Name"    = "redis-evaluation"
22:48:42.316 STDOUT tofu:           + "Project" = "toggle-master"
22:48:42.316 STDOUT tofu:         }
22:48:42.316 STDOUT tofu:       + transit_encryption_enabled = (known after apply)
22:48:42.316 STDOUT tofu:     }
22:48:42.316 STDOUT tofu:   # module.redis["evaluation"].aws_elasticache_subnet_group.this will be created
22:48:42.316 STDOUT tofu:   + resource "aws_elasticache_subnet_group" "this" {
22:48:42.316 STDOUT tofu:       + arn         = (known after apply)
22:48:42.316 STDOUT tofu:       + description = "Managed by Terraform"
22:48:42.316 STDOUT tofu:       + id          = (known after apply)
22:48:42.316 STDOUT tofu:       + name        = "redis-evaluation-subnet-group"
22:48:42.316 STDOUT tofu:       + subnet_ids  = (known after apply)
22:48:42.316 STDOUT tofu:       + tags        = {
22:48:42.316 STDOUT tofu:           + "Env"     = "dev"
22:48:42.316 STDOUT tofu:           + "Name"    = "redis-evaluation-subnet-group"
22:48:42.316 STDOUT tofu:           + "Project" = "toggle-master"
22:48:42.316 STDOUT tofu:         }
22:48:42.316 STDOUT tofu:       + tags_all    = {
22:48:42.316 STDOUT tofu:           + "Env"     = "dev"
22:48:42.316 STDOUT tofu:           + "Name"    = "redis-evaluation-subnet-group"
22:48:42.316 STDOUT tofu:           + "Project" = "toggle-master"
22:48:42.316 STDOUT tofu:         }
22:48:42.316 STDOUT tofu:       + vpc_id      = (known after apply)
22:48:42.316 STDOUT tofu:     }
22:48:42.316 STDOUT tofu:   # module.redis["evaluation"].aws_security_group.this will be created
22:48:42.316 STDOUT tofu:   + resource "aws_security_group" "this" {
22:48:42.317 STDOUT tofu:       + arn                    = (known after apply)
22:48:42.317 STDOUT tofu:       + description            = "Security group for Redis redis-evaluation"
22:48:42.317 STDOUT tofu:       + egress                 = [
22:48:42.317 STDOUT tofu:           + {
22:48:42.317 STDOUT tofu:               + cidr_blocks      = [
22:48:42.317 STDOUT tofu:                   + "0.0.0.0/0",
22:48:42.317 STDOUT tofu:                 ]
22:48:42.317 STDOUT tofu:               + description      = ""
22:48:42.317 STDOUT tofu:               + from_port        = 0
22:48:42.317 STDOUT tofu:               + ipv6_cidr_blocks = []
22:48:42.317 STDOUT tofu:               + prefix_list_ids  = []
22:48:42.317 STDOUT tofu:               + protocol         = "-1"
22:48:42.317 STDOUT tofu:               + security_groups  = []
22:48:42.317 STDOUT tofu:               + self             = false
22:48:42.317 STDOUT tofu:               + to_port          = 0
22:48:42.317 STDOUT tofu:             },
22:48:42.317 STDOUT tofu:         ]
22:48:42.317 STDOUT tofu:       + id                     = (known after apply)
22:48:42.317 STDOUT tofu:       + ingress                = [
22:48:42.317 STDOUT tofu:           + {
22:48:42.317 STDOUT tofu:               + cidr_blocks      = [
22:48:42.317 STDOUT tofu:                   + "10.0.0.0/16",
22:48:42.317 STDOUT tofu:                 ]
22:48:42.317 STDOUT tofu:               + description      = ""
22:48:42.317 STDOUT tofu:               + from_port        = 6379
22:48:42.317 STDOUT tofu:               + ipv6_cidr_blocks = []
22:48:42.317 STDOUT tofu:               + prefix_list_ids  = []
22:48:42.317 STDOUT tofu:               + protocol         = "tcp"
22:48:42.317 STDOUT tofu:               + security_groups  = []
22:48:42.317 STDOUT tofu:               + self             = false
22:48:42.317 STDOUT tofu:               + to_port          = 6379
22:48:42.318 STDOUT tofu:             },
22:48:42.318 STDOUT tofu:         ]
22:48:42.318 STDOUT tofu:       + name                   = "toggle-master-dev-redis-evaluation-sg"
22:48:42.318 STDOUT tofu:       + name_prefix            = (known after apply)
22:48:42.318 STDOUT tofu:       + owner_id               = (known after apply)
22:48:42.318 STDOUT tofu:       + revoke_rules_on_delete = false
22:48:42.318 STDOUT tofu:       + tags                   = {
22:48:42.318 STDOUT tofu:           + "Env"     = "dev"
22:48:42.318 STDOUT tofu:           + "Name"    = "toggle-master-dev-redis-evaluation-sg"
22:48:42.318 STDOUT tofu:           + "Project" = "toggle-master"
22:48:42.318 STDOUT tofu:         }
22:48:42.318 STDOUT tofu:       + tags_all               = {
22:48:42.318 STDOUT tofu:           + "Env"     = "dev"
22:48:42.318 STDOUT tofu:           + "Name"    = "toggle-master-dev-redis-evaluation-sg"
22:48:42.318 STDOUT tofu:           + "Project" = "toggle-master"
22:48:42.318 STDOUT tofu:         }
22:48:42.318 STDOUT tofu:       + vpc_id                 = (known after apply)
22:48:42.318 STDOUT tofu:     }
22:48:42.318 STDOUT tofu:   # module.s3.aws_s3_bucket.state will be created
22:48:42.318 STDOUT tofu:   + resource "aws_s3_bucket" "state" {
22:48:42.318 STDOUT tofu:       + acceleration_status         = (known after apply)
22:48:42.318 STDOUT tofu:       + acl                         = (known after apply)
22:48:42.318 STDOUT tofu:       + arn                         = (known after apply)
22:48:42.318 STDOUT tofu:       + bucket                      = "toggle-master-dev-app"
22:48:42.318 STDOUT tofu:       + bucket_domain_name          = (known after apply)
22:48:42.319 STDOUT tofu:       + bucket_prefix               = (known after apply)
22:48:42.319 STDOUT tofu:       + bucket_regional_domain_name = (known after apply)
22:48:42.319 STDOUT tofu:       + force_destroy               = true
22:48:42.319 STDOUT tofu:       + hosted_zone_id              = (known after apply)
22:48:42.319 STDOUT tofu:       + id                          = (known after apply)
22:48:42.319 STDOUT tofu:       + object_lock_enabled         = (known after apply)
22:48:42.319 STDOUT tofu:       + policy                      = (known after apply)
22:48:42.319 STDOUT tofu:       + region                      = (known after apply)
22:48:42.319 STDOUT tofu:       + request_payer               = (known after apply)
22:48:42.319 STDOUT tofu:       + tags                        = {
22:48:42.319 STDOUT tofu:           + "Name"    = "toggle-master-dev-app"
22:48:42.319 STDOUT tofu:           + "Project" = "toggle-master"
22:48:42.319 STDOUT tofu:         }
22:48:42.319 STDOUT tofu:       + tags_all                    = {
22:48:42.319 STDOUT tofu:           + "Name"    = "toggle-master-dev-app"
22:48:42.319 STDOUT tofu:           + "Project" = "toggle-master"
22:48:42.319 STDOUT tofu:         }
22:48:42.319 STDOUT tofu:       + website_domain              = (known after apply)
22:48:42.319 STDOUT tofu:       + website_endpoint            = (known after apply)
22:48:42.319 STDOUT tofu:       + cors_rule (known after apply)
22:48:42.319 STDOUT tofu:       + grant (known after apply)
22:48:42.319 STDOUT tofu:       + lifecycle_rule (known after apply)
22:48:42.319 STDOUT tofu:       + logging (known after apply)
22:48:42.320 STDOUT tofu:       + object_lock_configuration (known after apply)
22:48:42.320 STDOUT tofu:       + replication_configuration (known after apply)
22:48:42.320 STDOUT tofu:       + server_side_encryption_configuration (known after apply)
22:48:42.320 STDOUT tofu:       + versioning (known after apply)
22:48:42.320 STDOUT tofu:       + website (known after apply)
22:48:42.320 STDOUT tofu:     }
22:48:42.320 STDOUT tofu:   # module.s3.aws_s3_bucket_server_side_encryption_configuration.state_encryption will be created
22:48:42.320 STDOUT tofu:   + resource "aws_s3_bucket_server_side_encryption_configuration" "state_encryption" {
22:48:42.320 STDOUT tofu:       + bucket = (known after apply)
22:48:42.320 STDOUT tofu:       + id     = (known after apply)
22:48:42.320 STDOUT tofu:       + rule {
22:48:42.320 STDOUT tofu:           + apply_server_side_encryption_by_default {
22:48:42.320 STDOUT tofu:               + sse_algorithm = "AES256"
22:48:42.320 STDOUT tofu:             }
22:48:42.320 STDOUT tofu:         }
22:48:42.320 STDOUT tofu:     }
22:48:42.320 STDOUT tofu:   # module.s3.aws_s3_bucket_versioning.state_ver will be created
22:48:42.320 STDOUT tofu:   + resource "aws_s3_bucket_versioning" "state_ver" {
22:48:42.320 STDOUT tofu:       + bucket = (known after apply)
22:48:42.320 STDOUT tofu:       + id     = (known after apply)
22:48:42.320 STDOUT tofu:       + versioning_configuration {
22:48:42.320 STDOUT tofu:           + mfa_delete = (known after apply)
22:48:42.321 STDOUT tofu:           + status     = "Enabled"
22:48:42.321 STDOUT tofu:         }
22:48:42.321 STDOUT tofu:     }
22:48:42.321 STDOUT tofu:   # module.sqs["analytics"].aws_sqs_queue.dlq[0] will be created
22:48:42.321 STDOUT tofu:   + resource "aws_sqs_queue" "dlq" {
22:48:42.321 STDOUT tofu:       + arn                               = (known after apply)
22:48:42.321 STDOUT tofu:       + content_based_deduplication       = false
22:48:42.321 STDOUT tofu:       + deduplication_scope               = (known after apply)
22:48:42.321 STDOUT tofu:       + delay_seconds                     = 0
22:48:42.321 STDOUT tofu:       + fifo_queue                        = false
22:48:42.321 STDOUT tofu:       + fifo_throughput_limit             = (known after apply)
22:48:42.321 STDOUT tofu:       + id                                = (known after apply)
22:48:42.321 STDOUT tofu:       + kms_data_key_reuse_period_seconds = (known after apply)
22:48:42.321 STDOUT tofu:       + max_message_size                  = 262144
22:48:42.321 STDOUT tofu:       + message_retention_seconds         = 1209600
22:48:42.321 STDOUT tofu:       + name                              = "toggle-analytics-queue-dlq"
22:48:42.321 STDOUT tofu:       + name_prefix                       = (known after apply)
22:48:42.322 STDOUT tofu:       + policy                            = (known after apply)
22:48:42.322 STDOUT tofu:       + receive_wait_time_seconds         = 0
22:48:42.322 STDOUT tofu:       + redrive_allow_policy              = (known after apply)
22:48:42.322 STDOUT tofu:       + redrive_policy                    = (known after apply)
22:48:42.322 STDOUT tofu:       + sqs_managed_sse_enabled           = (known after apply)
22:48:42.322 STDOUT tofu:       + tags                              = {
22:48:42.322 STDOUT tofu:           + "Env"     = "dev"
22:48:42.322 STDOUT tofu:           + "Name"    = "toggle-analytics-queue-dlq"
22:48:42.322 STDOUT tofu:           + "Project" = "toggle-master"
22:48:42.322 STDOUT tofu:         }
22:48:42.322 STDOUT tofu:       + tags_all                          = {
22:48:42.322 STDOUT tofu:           + "Env"     = "dev"
22:48:42.322 STDOUT tofu:           + "Name"    = "toggle-analytics-queue-dlq"
22:48:42.322 STDOUT tofu:           + "Project" = "toggle-master"
22:48:42.322 STDOUT tofu:         }
22:48:42.322 STDOUT tofu:       + url                               = (known after apply)
22:48:42.323 STDOUT tofu:       + visibility_timeout_seconds        = 30
22:48:42.323 STDOUT tofu:     }
22:48:42.323 STDOUT tofu:   # module.sqs["analytics"].aws_sqs_queue.this will be created
22:48:42.323 STDOUT tofu:   + resource "aws_sqs_queue" "this" {
22:48:42.323 STDOUT tofu:       + arn                               = (known after apply)
22:48:42.323 STDOUT tofu:       + content_based_deduplication       = false
22:48:42.323 STDOUT tofu:       + deduplication_scope               = (known after apply)
22:48:42.323 STDOUT tofu:       + delay_seconds                     = 0
22:48:42.323 STDOUT tofu:       + fifo_queue                        = false
22:48:42.323 STDOUT tofu:       + fifo_throughput_limit             = (known after apply)
22:48:42.323 STDOUT tofu:       + id                                = (known after apply)
22:48:42.323 STDOUT tofu:       + kms_data_key_reuse_period_seconds = (known after apply)
22:48:42.323 STDOUT tofu:       + max_message_size                  = 262144
22:48:42.323 STDOUT tofu:       + message_retention_seconds         = 86400
22:48:42.323 STDOUT tofu:       + name                              = "toggle-analytics-queue"
22:48:42.323 STDOUT tofu:       + name_prefix                       = (known after apply)
22:48:42.324 STDOUT tofu:       + policy                            = (known after apply)
22:48:42.324 STDOUT tofu:       + receive_wait_time_seconds         = 0
22:48:42.324 STDOUT tofu:       + redrive_allow_policy              = (known after apply)
22:48:42.324 STDOUT tofu:       + redrive_policy                    = (known after apply)
22:48:42.324 STDOUT tofu:       + sqs_managed_sse_enabled           = (known after apply)
22:48:42.324 STDOUT tofu:       + tags                              = {
22:48:42.324 STDOUT tofu:           + "Env"     = "dev"
22:48:42.324 STDOUT tofu:           + "Name"    = "toggle-analytics-queue"
22:48:42.324 STDOUT tofu:           + "Project" = "toggle-master"
22:48:42.324 STDOUT tofu:         }
22:48:42.324 STDOUT tofu:       + tags_all                          = {
22:48:42.324 STDOUT tofu:           + "Env"     = "dev"
22:48:42.324 STDOUT tofu:           + "Name"    = "toggle-analytics-queue"
22:48:42.324 STDOUT tofu:           + "Project" = "toggle-master"
22:48:42.324 STDOUT tofu:         }
22:48:42.324 STDOUT tofu:       + url                               = (known after apply)
22:48:42.324 STDOUT tofu:       + visibility_timeout_seconds        = 30
22:48:42.325 STDOUT tofu:     }
22:48:42.325 STDOUT tofu:   # module.vpc.aws_eip.nat_eip will be created
22:48:42.325 STDOUT tofu:   + resource "aws_eip" "nat_eip" {
22:48:42.325 STDOUT tofu:       + allocation_id        = (known after apply)
22:48:42.325 STDOUT tofu:       + arn                  = (known after apply)
22:48:42.325 STDOUT tofu:       + association_id       = (known after apply)
22:48:42.325 STDOUT tofu:       + carrier_ip           = (known after apply)
22:48:42.325 STDOUT tofu:       + customer_owned_ip    = (known after apply)
22:48:42.325 STDOUT tofu:       + domain               = "vpc"
22:48:42.325 STDOUT tofu:       + id                   = (known after apply)
22:48:42.325 STDOUT tofu:       + instance             = (known after apply)
22:48:42.325 STDOUT tofu:       + ipam_pool_id         = (known after apply)
22:48:42.325 STDOUT tofu:       + network_border_group = (known after apply)
22:48:42.325 STDOUT tofu:       + network_interface    = (known after apply)
22:48:42.325 STDOUT tofu:       + private_dns          = (known after apply)
22:48:42.325 STDOUT tofu:       + private_ip           = (known after apply)
22:48:42.325 STDOUT tofu:       + ptr_record           = (known after apply)
22:48:42.326 STDOUT tofu:       + public_dns           = (known after apply)
22:48:42.326 STDOUT tofu:       + public_ip            = (known after apply)
22:48:42.326 STDOUT tofu:       + public_ipv4_pool     = (known after apply)
22:48:42.326 STDOUT tofu:       + tags                 = {
22:48:42.326 STDOUT tofu:           + "Name"    = "toggle-master-dev-nat-eip"
22:48:42.326 STDOUT tofu:           + "Project" = "toggle-master"
22:48:42.326 STDOUT tofu:         }
22:48:42.326 STDOUT tofu:       + tags_all             = {
22:48:42.326 STDOUT tofu:           + "Name"    = "toggle-master-dev-nat-eip"
22:48:42.326 STDOUT tofu:           + "Project" = "toggle-master"
22:48:42.326 STDOUT tofu:         }
22:48:42.326 STDOUT tofu:       + vpc                  = (known after apply)
22:48:42.326 STDOUT tofu:     }
22:48:42.326 STDOUT tofu:   # module.vpc.aws_internet_gateway.igw will be created
22:48:42.326 STDOUT tofu:   + resource "aws_internet_gateway" "igw" {
22:48:42.326 STDOUT tofu:       + arn      = (known after apply)
22:48:42.326 STDOUT tofu:       + id       = (known after apply)
22:48:42.326 STDOUT tofu:       + owner_id = (known after apply)
22:48:42.326 STDOUT tofu:       + tags     = {
22:48:42.326 STDOUT tofu:           + "Name"    = "toggle-master-dev-igw"
22:48:42.327 STDOUT tofu:           + "Project" = "toggle-master"
22:48:42.327 STDOUT tofu:         }
22:48:42.327 STDOUT tofu:       + tags_all = {
22:48:42.327 STDOUT tofu:           + "Name"    = "toggle-master-dev-igw"
22:48:42.327 STDOUT tofu:           + "Project" = "toggle-master"
22:48:42.327 STDOUT tofu:         }
22:48:42.327 STDOUT tofu:       + vpc_id   = (known after apply)
22:48:42.327 STDOUT tofu:     }
22:48:42.327 STDOUT tofu:   # module.vpc.aws_nat_gateway.nat will be created
22:48:42.327 STDOUT tofu:   + resource "aws_nat_gateway" "nat" {
22:48:42.327 STDOUT tofu:       + allocation_id                      = (known after apply)
22:48:42.327 STDOUT tofu:       + association_id                     = (known after apply)
22:48:42.327 STDOUT tofu:       + connectivity_type                  = "public"
22:48:42.327 STDOUT tofu:       + id                                 = (known after apply)
22:48:42.327 STDOUT tofu:       + network_interface_id               = (known after apply)
22:48:42.327 STDOUT tofu:       + private_ip                         = (known after apply)
22:48:42.327 STDOUT tofu:       + public_ip                          = (known after apply)
22:48:42.327 STDOUT tofu:       + secondary_private_ip_address_count = (known after apply)
22:48:42.328 STDOUT tofu:       + secondary_private_ip_addresses     = (known after apply)
22:48:42.328 STDOUT tofu:       + subnet_id                          = (known after apply)
22:48:42.328 STDOUT tofu:       + tags                               = {
22:48:42.328 STDOUT tofu:           + "Name"    = "toggle-master-dev-nat"
22:48:42.328 STDOUT tofu:           + "Project" = "toggle-master"
22:48:42.328 STDOUT tofu:         }
22:48:42.328 STDOUT tofu:       + tags_all                           = {
22:48:42.328 STDOUT tofu:           + "Name"    = "toggle-master-dev-nat"
22:48:42.328 STDOUT tofu:           + "Project" = "toggle-master"
22:48:42.328 STDOUT tofu:         }
22:48:42.328 STDOUT tofu:     }
22:48:42.328 STDOUT tofu:   # module.vpc.aws_route_table.private will be created
22:48:42.328 STDOUT tofu:   + resource "aws_route_table" "private" {
22:48:42.328 STDOUT tofu:       + arn              = (known after apply)
22:48:42.328 STDOUT tofu:       + id               = (known after apply)
22:48:42.328 STDOUT tofu:       + owner_id         = (known after apply)
22:48:42.328 STDOUT tofu:       + propagating_vgws = (known after apply)
22:48:42.328 STDOUT tofu:       + route            = [
22:48:42.328 STDOUT tofu:           + {
22:48:42.328 STDOUT tofu:               + carrier_gateway_id         = ""
22:48:42.329 STDOUT tofu:               + cidr_block                 = "0.0.0.0/0"
22:48:42.329 STDOUT tofu:               + core_network_arn           = ""
22:48:42.329 STDOUT tofu:               + destination_prefix_list_id = ""
22:48:42.329 STDOUT tofu:               + egress_only_gateway_id     = ""
22:48:42.329 STDOUT tofu:               + gateway_id                 = ""
22:48:42.329 STDOUT tofu:               + ipv6_cidr_block            = ""
22:48:42.329 STDOUT tofu:               + local_gateway_id           = ""
22:48:42.329 STDOUT tofu:               + nat_gateway_id             = (known after apply)
22:48:42.329 STDOUT tofu:               + network_interface_id       = ""
22:48:42.329 STDOUT tofu:               + transit_gateway_id         = ""
22:48:42.329 STDOUT tofu:               + vpc_endpoint_id            = ""
22:48:42.329 STDOUT tofu:               + vpc_peering_connection_id  = ""
22:48:42.329 STDOUT tofu:             },
22:48:42.329 STDOUT tofu:         ]
22:48:42.329 STDOUT tofu:       + tags             = {
22:48:42.329 STDOUT tofu:           + "Name"    = "toggle-master-dev-private-rt"
22:48:42.329 STDOUT tofu:           + "Project" = "toggle-master"
22:48:42.329 STDOUT tofu:         }
22:48:42.329 STDOUT tofu:       + tags_all         = {
22:48:42.329 STDOUT tofu:           + "Name"    = "toggle-master-dev-private-rt"
22:48:42.329 STDOUT tofu:           + "Project" = "toggle-master"
22:48:42.329 STDOUT tofu:         }
22:48:42.329 STDOUT tofu:       + vpc_id           = (known after apply)
22:48:42.329 STDOUT tofu:     }
22:48:42.329 STDOUT tofu:   # module.vpc.aws_route_table.public will be created
22:48:42.329 STDOUT tofu:   + resource "aws_route_table" "public" {
22:48:42.329 STDOUT tofu:       + arn              = (known after apply)
22:48:42.329 STDOUT tofu:       + id               = (known after apply)
22:48:42.330 STDOUT tofu:       + owner_id         = (known after apply)
22:48:42.330 STDOUT tofu:       + propagating_vgws = (known after apply)
22:48:42.330 STDOUT tofu:       + route            = [
22:48:42.330 STDOUT tofu:           + {
22:48:42.330 STDOUT tofu:               + carrier_gateway_id         = ""
22:48:42.330 STDOUT tofu:               + cidr_block                 = "0.0.0.0/0"
22:48:42.330 STDOUT tofu:               + core_network_arn           = ""
22:48:42.330 STDOUT tofu:               + destination_prefix_list_id = ""
22:48:42.330 STDOUT tofu:               + egress_only_gateway_id     = ""
22:48:42.330 STDOUT tofu:               + gateway_id  

... (truncado)
```